GopalSaraf/Practicals/PSDL/include/proc/pic18f23k22.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0F7Ah
// bitfield definitions
PIE4_CCP3IE_POSN                         equ 0000h
PIE4_CCP3IE_POSITION                     equ 0000h
PIE4_CCP3IE_SIZE                         equ 0001h
PIE4_CCP3IE_LENGTH                       equ 0001h
PIE4_CCP3IE_MASK                         equ 0001h
PIE4_CCP4IE_POSN                         equ 0001h
PIE4_CCP4IE_POSITION                     equ 0001h
PIE4_CCP4IE_SIZE                         equ 0001h
PIE4_CCP4IE_LENGTH                       equ 0001h
PIE4_CCP4IE_MASK                         equ 0002h
PIE4_CCP5IE_POSN                         equ 0002h
PIE4_CCP5IE_POSITION                     equ 0002h
PIE4_CCP5IE_SIZE                         equ 0001h
PIE4_CCP5IE_LENGTH                       equ 0001h
PIE4_CCP5IE_MASK                         equ 0004h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0F7Bh
// bitfield definitions
PIR4_CCP3IF_POSN                         equ 0000h
PIR4_CCP3IF_POSITION                     equ 0000h
PIR4_CCP3IF_SIZE                         equ 0001h
PIR4_CCP3IF_LENGTH                       equ 0001h
PIR4_CCP3IF_MASK                         equ 0001h
PIR4_CCP4IF_POSN                         equ 0001h
PIR4_CCP4IF_POSITION                     equ 0001h
PIR4_CCP4IF_SIZE                         equ 0001h
PIR4_CCP4IF_LENGTH                       equ 0001h
PIR4_CCP4IF_MASK                         equ 0002h
PIR4_CCP5IF_POSN                         equ 0002h
PIR4_CCP5IF_POSITION                     equ 0002h
PIR4_CCP5IF_SIZE                         equ 0001h
PIR4_CCP5IF_LENGTH                       equ 0001h
PIR4_CCP5IF_MASK                         equ 0004h

// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 0F7Ch
// bitfield definitions
IPR4_CCP3IP_POSN                         equ 0000h
IPR4_CCP3IP_POSITION                     equ 0000h
IPR4_CCP3IP_SIZE                         equ 0001h
IPR4_CCP3IP_LENGTH                       equ 0001h
IPR4_CCP3IP_MASK                         equ 0001h
IPR4_CCP4IP_POSN                         equ 0001h
IPR4_CCP4IP_POSITION                     equ 0001h
IPR4_CCP4IP_SIZE                         equ 0001h
IPR4_CCP4IP_LENGTH                       equ 0001h
IPR4_CCP4IP_MASK                         equ 0002h
IPR4_CCP5IP_POSN                         equ 0002h
IPR4_CCP5IP_POSITION                     equ 0002h
IPR4_CCP5IP_SIZE                         equ 0001h
IPR4_CCP5IP_LENGTH                       equ 0001h
IPR4_CCP5IP_MASK                         equ 0004h
IPR4_CCIP3IP_POSN                        equ 0000h
IPR4_CCIP3IP_POSITION                    equ 0000h
IPR4_CCIP3IP_SIZE                        equ 0001h
IPR4_CCIP3IP_LENGTH                      equ 0001h
IPR4_CCIP3IP_MASK                        equ 0001h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0F7Dh
// bitfield definitions
PIE5_TMR4IE_POSN                         equ 0000h
PIE5_TMR4IE_POSITION                     equ 0000h
PIE5_TMR4IE_SIZE                         equ 0001h
PIE5_TMR4IE_LENGTH                       equ 0001h
PIE5_TMR4IE_MASK                         equ 0001h
PIE5_TMR5IE_POSN                         equ 0001h
PIE5_TMR5IE_POSITION                     equ 0001h
PIE5_TMR5IE_SIZE                         equ 0001h
PIE5_TMR5IE_LENGTH                       equ 0001h
PIE5_TMR5IE_MASK                         equ 0002h
PIE5_TMR6IE_POSN                         equ 0002h
PIE5_TMR6IE_POSITION                     equ 0002h
PIE5_TMR6IE_SIZE                         equ 0001h
PIE5_TMR6IE_LENGTH                       equ 0001h
PIE5_TMR6IE_MASK                         equ 0004h

// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0F7Eh
// bitfield definitions
PIR5_TMR4IF_POSN                         equ 0000h
PIR5_TMR4IF_POSITION                     equ 0000h
PIR5_TMR4IF_SIZE                         equ 0001h
PIR5_TMR4IF_LENGTH                       equ 0001h
PIR5_TMR4IF_MASK                         equ 0001h
PIR5_TMR5IF_POSN                         equ 0001h
PIR5_TMR5IF_POSITION                     equ 0001h
PIR5_TMR5IF_SIZE                         equ 0001h
PIR5_TMR5IF_LENGTH                       equ 0001h
PIR5_TMR5IF_MASK                         equ 0002h
PIR5_TMR6IF_POSN                         equ 0002h
PIR5_TMR6IF_POSITION                     equ 0002h
PIR5_TMR6IF_SIZE                         equ 0001h
PIR5_TMR6IF_LENGTH                       equ 0001h
PIR5_TMR6IF_MASK                         equ 0004h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0F7Fh
// bitfield definitions
IPR5_TMR4IP_POSN                         equ 0000h
IPR5_TMR4IP_POSITION                     equ 0000h
IPR5_TMR4IP_SIZE                         equ 0001h
IPR5_TMR4IP_LENGTH                       equ 0001h
IPR5_TMR4IP_MASK                         equ 0001h
IPR5_TMR5IP_POSN                         equ 0001h
IPR5_TMR5IP_POSITION                     equ 0001h
IPR5_TMR5IP_SIZE                         equ 0001h
IPR5_TMR5IP_LENGTH                       equ 0001h
IPR5_TMR5IP_MASK                         equ 0002h
IPR5_TMR6IP_POSN                         equ 0002h
IPR5_TMR6IP_POSITION                     equ 0002h
IPR5_TMR6IP_SIZE                         equ 0001h
IPR5_TMR6IP_LENGTH                       equ 0001h
IPR5_TMR6IP_MASK                         equ 0004h
IPR5_CCH05_POSN                          equ 0000h
IPR5_CCH05_POSITION                      equ 0000h
IPR5_CCH05_SIZE                          equ 0001h
IPR5_CCH05_LENGTH                        equ 0001h
IPR5_CCH05_MASK                          equ 0001h
IPR5_CCH15_POSN                          equ 0001h
IPR5_CCH15_POSITION                      equ 0001h
IPR5_CCH15_SIZE                          equ 0001h
IPR5_CCH15_LENGTH                        equ 0001h
IPR5_CCH15_MASK                          equ 0002h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_RA7_POSN                           equ 0007h
PORTA_RA7_POSITION                       equ 0007h
PORTA_RA7_SIZE                           equ 0001h
PORTA_RA7_LENGTH                         equ 0001h
PORTA_RA7_MASK                           equ 0080h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0003h
PORTA_AN3_POSITION                       equ 0003h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0008h
PORTA_AN4_POSN                           equ 0005h
PORTA_AN4_POSITION                       equ 0005h
PORTA_AN4_SIZE                           equ 0001h
PORTA_AN4_LENGTH                         equ 0001h
PORTA_AN4_MASK                           equ 0020h
PORTA_C12IN0M_POSN                       equ 0000h
PORTA_C12IN0M_POSITION                   equ 0000h
PORTA_C12IN0M_SIZE                       equ 0001h
PORTA_C12IN0M_LENGTH                     equ 0001h
PORTA_C12IN0M_MASK                       equ 0001h
PORTA_C12IN1M_POSN                       equ 0001h
PORTA_C12IN1M_POSITION                   equ 0001h
PORTA_C12IN1M_SIZE                       equ 0001h
PORTA_C12IN1M_LENGTH                     equ 0001h
PORTA_C12IN1M_MASK                       equ 0002h
PORTA_C2INP_POSN                         equ 0002h
PORTA_C2INP_POSITION                     equ 0002h
PORTA_C2INP_SIZE                         equ 0001h
PORTA_C2INP_LENGTH                       equ 0001h
PORTA_C2INP_MASK                         equ 0004h
PORTA_C1INP_POSN                         equ 0003h
PORTA_C1INP_POSITION                     equ 0003h
PORTA_C1INP_SIZE                         equ 0001h
PORTA_C1INP_LENGTH                       equ 0001h
PORTA_C1INP_MASK                         equ 0008h
PORTA_C1OUT_POSN                         equ 0004h
PORTA_C1OUT_POSITION                     equ 0004h
PORTA_C1OUT_SIZE                         equ 0001h
PORTA_C1OUT_LENGTH                       equ 0001h
PORTA_C1OUT_MASK                         equ 0010h
PORTA_C2OUT_POSN                         equ 0005h
PORTA_C2OUT_POSITION                     equ 0005h
PORTA_C2OUT_SIZE                         equ 0001h
PORTA_C2OUT_LENGTH                       equ 0001h
PORTA_C2OUT_MASK                         equ 0020h
PORTA_C12IN0N_POSN                       equ 0000h
PORTA_C12IN0N_POSITION                   equ 0000h
PORTA_C12IN0N_SIZE                       equ 0001h
PORTA_C12IN0N_LENGTH                     equ 0001h
PORTA_C12IN0N_MASK                       equ 0001h
PORTA_C12IN1N_POSN                       equ 0001h
PORTA_C12IN1N_POSITION                   equ 0001h
PORTA_C12IN1N_SIZE                       equ 0001h
PORTA_C12IN1N_LENGTH                     equ 0001h
PORTA_C12IN1N_MASK                       equ 0002h
PORTA_VREFM_POSN                         equ 0002h
PORTA_VREFM_POSITION                     equ 0002h
PORTA_VREFM_SIZE                         equ 0001h
PORTA_VREFM_LENGTH                       equ 0001h
PORTA_VREFM_MASK                         equ 0004h
PORTA_VREFP_POSN                         equ 0003h
PORTA_VREFP_POSITION                     equ 0003h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0008h
PORTA_T0CKI_POSN                         equ 0004h
PORTA_T0CKI_POSITION                     equ 0004h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0010h
PORTA_SS_POSN                            equ 0005h
PORTA_SS_POSITION                        equ 0005h
PORTA_SS_SIZE                            equ 0001h
PORTA_SS_LENGTH                          equ 0001h
PORTA_SS_MASK                            equ 0020h
PORTA_NOT_SS_POSN                        equ 0005h
PORTA_NOT_SS_POSITION                    equ 0005h
PORTA_NOT_SS_SIZE                        equ 0001h
PORTA_NOT_SS_LENGTH                      equ 0001h
PORTA_NOT_SS_MASK                        equ 0020h
PORTA_VREFN_POSN                         equ 0002h
PORTA_VREFN_POSITION                     equ 0002h
PORTA_VREFN_SIZE                         equ 0001h
PORTA_VREFN_LENGTH                       equ 0001h
PORTA_VREFN_MASK                         equ 0004h
PORTA_SRQ_POSN                           equ 0004h
PORTA_SRQ_POSITION                       equ 0004h
PORTA_SRQ_SIZE                           equ 0001h
PORTA_SRQ_LENGTH                         equ 0001h
PORTA_SRQ_MASK                           equ 0010h
PORTA_nSS_POSN                           equ 0005h
PORTA_nSS_POSITION                       equ 0005h
PORTA_nSS_SIZE                           equ 0001h
PORTA_nSS_LENGTH                         equ 0001h
PORTA_nSS_MASK                           equ 0020h
PORTA_CVREF_POSN                         equ 0002h
PORTA_CVREF_POSITION                     equ 0002h
PORTA_CVREF_SIZE                         equ 0001h
PORTA_CVREF_LENGTH                       equ 0001h
PORTA_CVREF_MASK                         equ 0004h
PORTA_CCP5_POSN                          equ 0004h
PORTA_CCP5_POSITION                      equ 0004h
PORTA_CCP5_SIZE                          equ 0001h
PORTA_CCP5_LENGTH                        equ 0001h
PORTA_CCP5_MASK                          equ 0010h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h
PORTA_DACOUT_POSN                        equ 0002h
PORTA_DACOUT_POSITION                    equ 0002h
PORTA_DACOUT_SIZE                        equ 0001h
PORTA_DACOUT_LENGTH                      equ 0001h
PORTA_DACOUT_MASK                        equ 0004h
PORTA_HLVDIN_POSN                        equ 0005h
PORTA_HLVDIN_POSITION                    equ 0005h
PORTA_HLVDIN_SIZE                        equ 0001h
PORTA_HLVDIN_LENGTH                      equ 0001h
PORTA_HLVDIN_MASK                        equ 0020h
PORTA_SS1_POSN                           equ 0005h
PORTA_SS1_POSITION                       equ 0005h
PORTA_SS1_SIZE                           equ 0001h
PORTA_SS1_LENGTH                         equ 0001h
PORTA_SS1_MASK                           equ 0020h
PORTA_NOT_SS1_POSN                       equ 0005h
PORTA_NOT_SS1_POSITION                   equ 0005h
PORTA_NOT_SS1_SIZE                       equ 0001h
PORTA_NOT_SS1_LENGTH                     equ 0001h
PORTA_NOT_SS1_MASK                       equ 0020h
PORTA_nSS1_POSN                          equ 0005h
PORTA_nSS1_POSITION                      equ 0005h
PORTA_nSS1_SIZE                          equ 0001h
PORTA_nSS1_LENGTH                        equ 0001h
PORTA_nSS1_MASK                          equ 0020h
PORTA_SRNQ_POSN                          equ 0005h
PORTA_SRNQ_POSITION                      equ 0005h
PORTA_SRNQ_SIZE                          equ 0001h
PORTA_SRNQ_LENGTH                        equ 0001h
PORTA_SRNQ_MASK                          equ 0020h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_RJPU_POSN                          equ 0007h
PORTA_RJPU_POSITION                      equ 0007h
PORTA_RJPU_SIZE                          equ 0001h
PORTA_RJPU_LENGTH                        equ 0001h
PORTA_RJPU_MASK                          equ 0080h

